{
    "lang": "en", 
    "data": {
        "FORM": {
            "AddRDS": {
                "Username": "Specify an alphanumeric string that defines the login ID for the master user. You use the master user login to start defining all users, objects, and permissions in a databases of your DB instance. Master Username must start with a letter.", 
                "AutoPause": "Specify the amount of time to pass with no database traffic before you scale to zero processing capacity. When database traffic resumes, your Serverless cluster resumes processing capacity and scales to handle the traffic.\\", 
                "DBParameterGroupName": "Database parameters group name.", 
                "EngineVersion": "Select database engine version. If not selected latest version will be used while creating database. Select type as 'Other' if you don't see desired option in dropdown list.", 
                "ClusterParameterGroupName": "Cluster parameters group name.", 
                "ClusterIdentifier": "Cluster Identifier", 
                "Identifier": "Provide unique identifier for the RDS instance across all tenants.  The cluster identifier is used in determining the cluster's endpoint.", 
                "EncryptionKey": "Choose to encrypt the given instance.", 
                "Engine": "Select Database engine for creating RDS instance.", 
                "MultiAZ": "Create database in multiple availability zones for high availability.", 
                "EnableLogging": "Select this option to enable logging for the RDS instance.", 
                "AutoPauseDuration": "Amount of time the cluster can be idle before scaling to zero", 
                "MinCapacity": "Set the minimum capacity unit for the DB cluster. Each capacity unit is equivalent to a specific compute and memory configuration.", 
                "AllocatedStorage": "Storage allication for RDS instance in GB.", 
                "DbSize": "Instance size for RDS. Select type as 'Other' if you don't see desired option in dropdown list.", 
                "SnapshotId": "Select this when you want to create RDS instance from existing Snapshot.", 
                "Password": "Specify a string that defines the password for the master user. Master Password must be at least eight characters long.", 
                "MaxCapacity": "Set the maximum capacity unit for the DB cluster. Each capacity unit is equivalent to a specific compute and memory configuration."
            }, 
            "AddEC2Host": {
                "maxInstanceCount": "Maximum Instance Count. Autoscaling group will make sure that total no of instance will always be less than or equal to min coiunt.", 
                "InstanceCount": "Desired capacity for the autoscaling group.", 
                "Name": "Friendly name for host. Your name will be appended by duplo prefix as \"duploservice-<tenant_name>-\"", 
                "tags": "Tags to be added to ec2 instance. Format for adding tags is as below\nTags to be added to ec2 instance. Format for adding tags is as below\n```js\n{\n    \"key\" : \"value\"\n}\n```\n", 
                "volumes": "Array of extra block devices in json format as below.\n```js\n[\n    {\n        \"Name\":\"/dev/sdA\", \n        \"VolumeType\":\"Gp2\", \n        \"Size\":\"100\"\n    }\n]\n```\n", 
                "minInstanceCount": "Minimum Instance Count. Autoscaling group will make sure that total no of instance will always be greater than or equal to min coiunt.", 
                "base64": "Base64 encoded user data. On linux machine you can encode script file using command ```cat <falepath> | base64 -w 0 ```.", 
                "InstanceType": "Instance type for the host. Select type as \"Other\" if you dont see desired option in the dropdown.", 
                "agentPlatform": "Select container orchastration platform.\n1. **Linux Docker/Native:** Select this option if you want to run docker native serices which are Linux based.\n2. **Windows Docker/Native:** Select this option if you want to run docker native serices which are Windwows based.\n3. **EKS Linux:** Select this options if you want to run services on the Kubenetese Cluster.\n4. **None:** This option has to be selected when EC2 instance is not used for running containers.\n", 
                "allocationTags": "Allocation tags for the Host. Allocation tags can be used to distribute the services accross hosts.", 
                "IsClusterAutoscaled": "Check this when you want kubernetese cluster autoscaller to manage this cluster auto scalling.", 
                "nwInterfaces": "Extra network interfaces to be attached to the ec2 host in a JSON format as below.\n```js\n  [\n  {\n    \"NetworkInterfaceId\": \"eni-095827b411091db43\",\n    \"DeviceIndex\": 0\n  },\n  {\n    \"NetworkInterfaceId\": \"eni-0df26c4b283cde675\",\n    \"DeviceIndex\": 1\n  }\n] \n```", 
                "ImageId": "AMI id for the EC2 instance. AMI should be compatible with the agent platform. Select type as \"Other\" if you dont see desired option in dropdown.", 
                "blockEBSOptimization": "Set this to enable block EBS optimization.", 
                "enableHibernation": "Set this to enable hibernation as an additional stop behavior."
            }
        }
    }
}